{
	"map_name": "SGV Von Neumann Mark III",
	"map_link": "vonneumann",
    "map_path": "map_files/vonneumann",
    "map_file": ["vnmk3.dmm"],
	"traits": [{"Linkage": "Self"}],
	"space_ruin_levels": -1,
	"space_empty_levels": 0,
	"shuttles": {
		"cargo": "cargo_serendipity",
		"ferry": "ferry_fancy"},
	"mine_disable": 1,
	"ship_type": "/obj/structure/overmap/nanotrasen/solgov/vnc/starter",
	"faction": "solgov",
	"starmap_path": "config/starmap/starmap.json",

    "map_description": "The Von Neumann Class frigate has a complex history, orginating as a proof of concept high-automation ship, the original Mark II was decomissioned when the lead ship and several others went missing from the dock. the hulls eventually were renewed as the Mark III point defense frigate with much of their automation and advanced technology ripped out. featuring a conventional drive system after the original classified engine was removed for undisclosed reasons, civilian grade hull, and a disproportionately large defensive armament, on the books this ship has only one job, to clear out space debris and asteroid fields. often seen escorting freighter convoys passing through dense asteroid fields(and sometimes pirate fields),  or in orbit of earth, vaporizing old satellites. occasionally you will see ships of this class escorting whiterapids fleets, nominally to aid them in making it through areas of particularly thick space debris. despite it's small size, this ship is almost fully equipped, although all heavy armament was removed during it's de-militarization, and the hull is distinctly reminiscent of that of a passanger liner's, she retains her shield generator, and various vestigial idiosyncrasies like the extremely high skeleton crew requirements compared to even larger ships",
    "manufacturer": "SolGov",
	"mapper": "Truncated-Cake",
    "commission_date": "May 19, 2264",
    "strengths": ["Legal energy shields", "Energy weapons", "Compact and easy to repair", "Highly Manuverable", "Rapidly regenerating armor", "Smallest ship to ever mount a Turing drive"],
    "weaknesses": ["Fragile", "Extremely Power-hungry", "Higher crew requirements", "Rather small", "Single reactor must be pushed to see any real functionality" ],
	"equipment": [
		"SolGov shield generator",
		"twin burst phaser MK2",
		"Quad Laser Anti Missile System",
		"Heavy Point Defense Laser Battery",
		"Missile Array",
		"2 light fighters",
		"Advanced Gas Cooled Nuclear Reactor",
		"Turing Drive",
		"Thermoelectric Generator"
	]
}
