{
	"map_name": "SGV Von Neumann Mark III",
	"map_link": "vonneumann",
    "map_path": "map_files/vonneumann",
    "map_file": ["vnmk3.dmm"],
	"traits": [{"Linkage": "Self"}],
	"space_ruin_levels": -1,
	"space_empty_levels": 0,
	"shuttles": {
		"cargo": "cargo_atlas",
		"ferry": "ferry_fancy"},
	"mine_disable": 1,
	"ship_type": "/obj/structure/overmap/nanotrasen/solgov/vnc/starter",
	"faction": "solgov",
	"starmap_path": "config/starmap/starmap.json",

    "map_description": "The Von Neumann Class, Mark III, is a small civilian point defense frigate, mounting fairly advanced technology in a small and robust hull, and a disproportately large point defense armament. The Mark III is the retrofitted version of the lesser known Mark II, a cancelled patrol frigate known to have mounted heavy automation- however the project was shelved when the lead ship vanished for no appearent reason. often used for clearing very dense asteroid fields, space junk, and escorting freighters through dangerously thick debris fields with their dense point defense armament,however the hull lacks any sort of real armor plating or defenses beyond shields, and mounts no heavy weapons, due to the lack of threat they usually face during their relatively mundane and civilian taskings. thanks to the removal of most automatic systems, and demilitarization these frigates have a higher crew requirement than even some larger ships. however when pressed into combat service, all the same, they can be extremely threatening thanks to their still extant VLS system(intitally planned to be removed in 2263, but due to cost overruns, the ships were launched with torpedo systems intact), and the sheer volume of point defense weapons. the ship itself, while fairly full featured, suffers from several vestigal features seen in the preceeding class, and is fairly cramped for crew",
    "manufacturer": "SolGov",
	"mapper": "Truncated-Cake",
    "commission_date": "May 19, 2264",
    "strengths": ["Legal energy shields", "Energy weapons", "Compact and easy to repair", "Highly Manuverable", "Rapidly regenerating armor", "Smallest ship to ever mount a Turing drive"],
    "weaknesses": ["Fragile", "Extremely Power-hungry", "Higher crew requirements", "Rather small", "Single reactor must be pushed to see any real functionality" ],
	"equipment": [
		"SolGov shield generator",
		"twin burst phaser MK2",
		"Quad Laser Anti Missile System",
		"Heavy Point Defense Laser Battery",
		"Missile Array",
		"2 light fighters",
		"Advanced Gas Cooled Nuclear Reactor",
		"Turing Drive",
		"Thermoelectric Generator"
	]
}
